
var table_data = {
    "data": [{
        "title": {
            "Name": "待付款",
            "Value": "123"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    },
    {
        "title": {
            "Name": "审核中",
            "Value": "98"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    },
    {
        "title": {
            "Name": "已发布",
            "Value": "157"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    },
    {
        "title": {
            "Name": "发起合同",
            "Value": "12"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    },
    {
        "title": {
            "Name": "签订合同",
            "Value": "40"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    },
    {
        "title": {
            "Name": "已评价",
            "Value": "345"
        },
        "table": [{
            "rowHeader": [{
                "headerName": "编号",
                "width": "464"
            },
            {
                "headerName": "名称",
                "width": "481"
            },
            {
                "headerName": "类型",
                "width": "481"
            }, {
                "headerName": "企业名称",
                "width": "481"
            },
            {
                "headerName": "预算",
                "width": "481"
            },
            {
                "headerName": "意向金",
                "width": "481"
            },
            {
                "headerName": "发布时间",
                "width": "481"
            },
            {
                "headerName": "有效时间",
                "width": "481"
            }
            ],
            "data": [
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ],
                [{
                    "value": "sp20197290009"
                },
                {
                    "value": "变压器"
                },
                {
                    "value": "设备销售"
                },
                {
                    "value": "国网上海"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "6,000"
                },
                {
                    "value": "2019-08-13"
                },
                {
                    "value": "2019-08-13"
                }
                ]
            ]
        }]
    }]
};

var showRealData = JKB["能源交易"]["交易详情"]["需求详情列表"]


$(function() {
    Flush();
    $.ajax({
        url: "http://localhost:2277/监控版/NYJY.asmx/GetRegionFQXFPM",
        type: "POST",
        async: true,
        data: "regionID=zj&startDate=2019-12&endDate=2020-01",
        error: function() {
            Flush();
           
        },
       success: function(data) {
            if(showRealData){
                table_data = JSON.parse(data);
                Flush();
            }  
        }
    });
    
    //延迟刷新
    setInterval(function () { $('body').css('background-color', 'rgba(0,0,0,0.00)');}, 2000);
});

function Flush(){
   
    yiji_title.length = 0;
    $('.nav').empty()


    $('.nav').append("<li id='tag'></li>");
    for (let i = 0; i < table_data['data'].length; i++) {
        $('.nav').append("<li class='liLink' role='presentation'><button class='titleButton' id=" + i + ">" + table_data['data'][i]['title']['Name'] + "&nbsp&nbsp&nbsp&nbsp" + table_data['data'][i]['title']['Value'] + "</button></li>")
    }
    $('.titleButton').click(function () {
        $('#show_table').empty();
        // 根据  li 的下标 去数组中找 如 li 下标为0 ，就去数组中找 第一个 标题的 table
        $('.titleButton').removeClass('checkedTitle');
        $(this).addClass('checkedTitle');

        var index = $(this).attr("id");

        for (let i = 0; i < table_data['data'][index]['table'].length; i++) {
            let tabvar = "";
            tabvar += "<div class='table'>";
            tabvar += "<table class='table-header'>";
            tabvar += "<tr>";
            // 添加 表的列名
            for (let j = 0; j < table_data['data'][index]['table'][i]['rowHeader'].length; j++) {
                if ("类型" == table_data['data'][index]['table'][i]['rowHeader'][j]['headerName']) {
                    tabvar += "<td style='width:" + table_data['data'][index]['table'][i]['rowHeader'][j]['width'] + "px'>类型：";
                    tabvar += "<div id='cmbBar' style='display:inline;'>";
                    tabvar += "<select id='cmb1' class='cs-select cs-skin-underline'>";
                    tabvar += "<option >全部</option>";
                    tabvar += "<option >代运维</option>";
                    tabvar += "<option >设备销售</option>";
                    tabvar += "<option >光伏建设</option>";
                    tabvar += "</select>";
                    tabvar += "</div>";
                    tabvar += "</td>";
                }
                else {
                    tabvar += "<td style='width:" + table_data['data'][index]['table'][i]['rowHeader'][j]['width'] + "px'>" + table_data['data'][index]['table'][i]['rowHeader'][j]['headerName'] + "</td>";
                }
            }
            tabvar += "</tr>";
            tabvar += "</table>";
            tabvar += "<span class='lineSpan'></span>";
            // 添加数据
            tabvar += "<table class='table-body'>";
            for (let j = 0; j < table_data['data'][index]['table'][i]['data'].length; j++) {
                tabvar += "<tr>";
                var column = table_data['data'][index]['table'][i]['data'][j].length;
                for (let k = 0; k < column; k++) {
                    // if (table_data['data'][0]['table'][0]['rowHeader'][k]['headerName'] == '详细地址')
                    //     tabvar += "<td class='unSelectedCell' style='width:" + table_data['data'][index]['table'][i]['rowHeader'][k]['width'] + "%;font-size:20px'>" + table_data['data'][index]['table'][i]['data'][j][k]['value'] + "</td>";
                    // else
                    //tabvar += "<td class='unSelectedCell' style='width:464px'>" + table_data['data'][index]['table'][i]['data'][j][k]['value'] + "</td>";
                    tabvar += "<td class='unSelectedCell' style='width:" + table_data['data'][index]['table'][i]['rowHeader'][k]['width'] + "px'>" + table_data['data'][index]['table'][i]['data'][j][k]['value'] + "</td>";
                }
                tabvar += "</tr>"
            }
            tabvar += "</table>";
            tabvar += "<span class='lineSpan'></span>";
            tabvar += "</div>";
            $('#show_table').append(tabvar);
        }
        // 当 表格中的行数大于 8 行时，只需添加一个高度 ，计算方式 8*36=288 ，行高 36px ，在Table_css.css 设置
        // 滑动效果当满足这个条件时，自动添加高度并触发
        for (let i = 0; i < $('.table-body').find('tbody').length; i++) {
            if ($(".table-body").find("tbody").eq(i).find("tr").length >= 3) {
                $(".table-body").css('height', "1930px");
            }
        }
        $('.table-body tr').click(function () {
            $(this).children().attr("class", "unSelectedCell");
        });
        //加载下拉菜单
        [].slice.call(document.querySelectorAll('select.cs-select')).forEach(function (el) {
            new SelectFx(el);
        });
    })
    $('.titleButton')[0].click();

    //延迟刷新
    setInterval(function () { $('body').css('background-color', 'rgba(0,0,0,0.00)') }, 1000);
};

ue.interface.Flush=function()
{
    Flush();
}

ue.interface.Load=function(data)
{
    var jsonData = JSON.parse(data);
    $.ajax({
        url: "http://localhost:2277/监控版/NYJY.asmx/"+jsonData['FunctionName'],
        type: "POST",
        async: true,
        data: jsonData['FunctionParam'],
        error: function() {
            Flush();
        },
        success: function(data) {
            if(showRealData){
                table_data = JSON.parse(data);
                Flush();
            }  
        }
    });

}